benchmarkResults/baseline_messaging.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 55s max duration (incl. graceful stop):
              * baseline_messaging: Up to 50 looping VUs for 25s over 3 stages (gracefulRampDown: 30s, exec: baselineMessaging, gracefulStop: 30s)


running (01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
baseline_messaging   [   4% ] 01/50 VUs  01.0s/25.0s

running (02.0s), 03/50 VUs, 3 complete and 0 interrupted iterations
baseline_messaging   [   8% ] 03/50 VUs  02.0s/25.0s

running (03.0s), 05/50 VUs, 10 complete and 0 interrupted iterations
baseline_messaging   [  12% ] 05/50 VUs  03.0s/25.0s

running (04.0s), 07/50 VUs, 21 complete and 0 interrupted iterations
baseline_messaging   [  16% ] 07/50 VUs  04.0s/25.0s

running (05.0s), 09/50 VUs, 36 complete and 0 interrupted iterations
baseline_messaging   [  20% ] 09/50 VUs  05.0s/25.0s

running (06.0s), 11/50 VUs, 55 complete and 0 interrupted iterations
baseline_messaging   [  24% ] 11/50 VUs  06.0s/25.0s

running (07.0s), 13/50 VUs, 78 complete and 0 interrupted iterations
baseline_messaging   [  28% ] 13/50 VUs  07.0s/25.0s

running (08.0s), 15/50 VUs, 105 complete and 0 interrupted iterations
baseline_messaging   [  32% ] 15/50 VUs  08.0s/25.0s

running (09.0s), 17/50 VUs, 135 complete and 0 interrupted iterations
baseline_messaging   [  36% ] 17/50 VUs  09.0s/25.0s

running (10.0s), 19/50 VUs, 167 complete and 0 interrupted iterations
baseline_messaging   [  40% ] 19/50 VUs  10.0s/25.0s

running (11.0s), 21/50 VUs, 199 complete and 0 interrupted iterations
baseline_messaging   [  44% ] 21/50 VUs  11.0s/25.0s

running (12.0s), 23/50 VUs, 231 complete and 0 interrupted iterations
baseline_messaging   [  48% ] 23/50 VUs  12.0s/25.0s

running (13.0s), 25/50 VUs, 263 complete and 0 interrupted iterations
baseline_messaging   [  52% ] 25/50 VUs  13.0s/25.0s

running (14.0s), 27/50 VUs, 295 complete and 0 interrupted iterations
baseline_messaging   [  56% ] 27/50 VUs  14.0s/25.0s

running (15.0s), 29/50 VUs, 327 complete and 0 interrupted iterations
baseline_messaging   [  60% ] 29/50 VUs  15.0s/25.0s

running (16.0s), 31/50 VUs, 359 complete and 0 interrupted iterations
baseline_messaging   [  64% ] 31/50 VUs  16.0s/25.0s

running (17.0s), 33/50 VUs, 391 complete and 0 interrupted iterations
baseline_messaging   [  68% ] 33/50 VUs  17.0s/25.0s

running (18.0s), 35/50 VUs, 423 complete and 0 interrupted iterations
baseline_messaging   [  72% ] 35/50 VUs  18.0s/25.0s

running (19.0s), 37/50 VUs, 455 complete and 0 interrupted iterations
baseline_messaging   [  76% ] 37/50 VUs  19.0s/25.0s

running (20.0s), 39/50 VUs, 487 complete and 0 interrupted iterations
baseline_messaging   [  80% ] 39/50 VUs  20.0s/25.0s

running (21.0s), 41/50 VUs, 519 complete and 0 interrupted iterations
baseline_messaging   [  84% ] 41/50 VUs  21.0s/25.0s

running (22.0s), 43/50 VUs, 551 complete and 0 interrupted iterations
baseline_messaging   [  88% ] 43/50 VUs  22.0s/25.0s

running (23.0s), 45/50 VUs, 583 complete and 0 interrupted iterations
baseline_messaging   [  92% ] 45/50 VUs  23.0s/25.0s

running (24.0s), 47/50 VUs, 615 complete and 0 interrupted iterations
baseline_messaging   [  96% ] 47/50 VUs  24.0s/25.0s

running (25.0s), 49/50 VUs, 647 complete and 0 interrupted iterations
baseline_messaging   [ 100% ] 49/50 VUs  25.0s/25.0s

running (26.0s), 17/50 VUs, 679 complete and 0 interrupted iterations
baseline_messaging ↓ [ 100% ] 49/50 VUs  25s
     ✓ [baseline_messaging] status 200

     checks.........................: 100.00% ✓ 696      ✗ 0   
     data_received..................: 456 kB  17 kB/s
     data_sent......................: 61 kB   2.3 kB/s
     http_req_blocked...............: avg=51.37µs  min=1µs      med=3µs   max=2.27ms p(90)=11µs    p(95)=463.74µs
     http_req_connecting............: avg=37.72µs  min=0s       med=0s    max=2.11ms p(90)=0s      p(95)=363.99µs
   ✗ http_req_duration..............: avg=942.15ms min=501.51ms med=1.01s max=1.92s  p(90)=1.52s   p(95)=1.53s   
       { expected_response:true }...: avg=942.15ms min=501.51ms med=1.01s max=1.92s  p(90)=1.52s   p(95)=1.53s   
     http_req_failed................: 0.00%   ✓ 0        ✗ 696 
     http_req_receiving.............: avg=89.59µs  min=16µs     med=36µs  max=5.26ms p(90)=131.5µs p(95)=171.24µs
     http_req_sending...............: avg=22.74µs  min=4µs      med=9µs   max=1.68ms p(90)=35µs    p(95)=64.74µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s    max=0s     p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=942.04ms min=501.47ms med=1.01s max=1.92s  p(90)=1.52s   p(95)=1.53s   
     http_reqs......................: 696     25.95704/s
     iteration_duration.............: avg=942.41ms min=501.61ms med=1.01s max=1.92s  p(90)=1.52s   p(95)=1.53s   
     iterations.....................: 696     25.95704/s
     vus............................: 17      min=1      max=49
     vus_max........................: 50      min=50     max=50
running (26.8s), 00/50 VUs, 696 complete and 0 interrupted iterations
baseline_messaging ✓ [ 100% ] 00/50 VUs  25s